Белгипрозем_2017/src/Catalogs/Мероприятия/Мероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мероприятия</name>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <basedOn>Catalog.ВнутренниеДокументы</basedOn>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <basedOn>Catalog.Мероприятия</basedOn>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Document.ВходящееПисьмо</basedOn>
  <basedOn>Document.ИсходящееПисьмо</basedOn>
  <basedOn>Catalog.Корреспонденты</basedOn>
  <basedOn>Catalog.КонтактныеЛица</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.ВидыМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресацииПредседателя</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресацииСекретаря</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьАвтоматическоеДобавлениеУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериалПрограмма</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>МатериалПротокол</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресацииПредседателя</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресацииСекретаря</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Председатель</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущееМероприятие</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Секретарь</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПрограммы</name>
    <type>
      <types>EnumRef.ТипыПрограммыПротокола</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПротокола</name>
    <type>
      <types>EnumRef.ТипыПрограммыПротокола</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Программа</name>
    <attributes>
      <name>НомерПункта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Окончание</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетПринятияРешения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Протокол</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПунктаПрограммы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>Слушали</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выступили</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Решили</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИсполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Enums/ТипыПрограммыПротокола/ТипыПрограммыПротокола.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПрограммыПротокола</name>
  <enumValues>
    <name>ВОтдельномДокументе</name>
  </enumValues>
  <enumValues>
    <name>ВТаблице</name>
  </enumValues>
  <enumValues>
    <name>ВМатериалах</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/Мероприятия/Forms/ПечатьКарточки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаголовокОтчета = "";
	
	ВыводитьДатуИМестоПроведения = Истина;
	ВыводитьПрограмму = Истина;
	ВыводитьУчастников = Истина;
	ВыводитьПредседателяИСекретаря = Истина;
	ВыводитьПротокол = Истина;
	
	ВОтдельномДокументе = Перечисления.ТипыПрограммыПротокола.ВОтдельномДокументе;
	ВТаблице = Перечисления.ТипыПрограммыПротокола.ВТаблице;
	ВМатериалах = Перечисления.ТипыПрограммыПротокола.ВМатериалах;
	
	Мероприятие = Параметры.ПараметрКоманды[0];
	РеквизитыМероприятия = 
		ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Мероприятие,
			"ТипПротокола, ТипПрограммы, ВидМероприятия");
			
	ТипПротокола = РеквизитыМероприятия.ТипПротокола;
	ТипПрограммы = РеквизитыМероприятия.ТипПрограммы;		
	ПротокольноеМероприятие = РеквизитыМероприятия.ВидМероприятия.ПротокольноеМероприятие;
	
	Элементы.ВыводитьПротокол.Видимость = (ТипПротокола = ВТаблице И ПротокольноеМероприятие);
	Элементы.ВыводитьПрограмму.Видимость = (ТипПрограммы = ВТаблице);
	Элементы.ВыводитьПредседателяИСекретаря.Видимость = ПротокольноеМероприятие;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ЗаголовокОтчета", ЗаголовокОтчета);
	ПараметрыПечати.Вставить("ВыводитьДатуИМестоПроведения", ВыводитьДатуИМестоПроведения);
	ПараметрыПечати.Вставить("ВыводитьУчастников", ВыводитьУчастников);
	
	Если ПротокольноеМероприятие Тогда 
		ПараметрыПечати.Вставить("ВыводитьПредседателяИСекретаря", ВыводитьПредседателяИСекретаря);
	Иначе
		ПараметрыПечати.Вставить("ВыводитьПредседателяИСекретаря", Ложь);
	КонецЕсли;
	
	Если ТипПрограммы = ВТаблице Тогда 
		ПараметрыПечати.Вставить("ВыводитьПрограмму", ВыводитьПрограмму);
	Иначе
		ПараметрыПечати.Вставить("ВыводитьПрограмму", Ложь);
	КонецЕсли;
	
	Если ТипПротокола = ВТаблице И ПротокольноеМероприятие Тогда 
		ПараметрыПечати.Вставить("ВыводитьПротокол", ВыводитьПротокол);
	Иначе	
		ПараметрыПечати.Вставить("ВыводитьПротокол", Ложь);	
	КонецЕсли;
	
	Закрыть();
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.Мероприятия", "Карточка", Параметры.ПараметрКоманды, ВладелецФормы, ПараметрыПечати);
	
КонецПроцедуры

#КонецОбласти
